package com.academy.telesens.Test;


import java.util.Scanner;

public class test {
    public static void main(String[] args) {

        /*1) Напишите программу, которая:
        - считывает строку
                - выводит исходную строку
        - выводит количество и список слов, которые начинаются на букву 'd'*/

       /* System.out.println("Введите строку");
        Scanner scanner = new Scanner(System.in);
        String str1 = scanner.nextLine();
        System.out.println("Ваша строка: ");*/

        String str1 = "Wsd hal def cnm da";








        }

}
